tlouwers/STM32F4-DISCOVERY/drivers/drivers/Dac/Dac.cpp
/**
 * \file    Dac.cpp
 *
 * \licence "THE BEER-WARE LICENSE" (Revision 42):
 *          <terry.louwers@fourtress.nl> wrote this file. As long as you retain
 *          this notice you can do whatever you want with this stuff. If we
 *          meet some day, and you think this stuff is worth it, you can buy me
 *          a beer in return.
 *                                                                Terry Louwers
 *
 * \brief   Dac peripheral driver class.
 *
 * \note    https://github.com/tlouwers/STM32F4-DISCOVERY/tree/develop/drivers/drivers/Dac
 *
 * \note    For 12-bit only using right alignment in order to be consistent with 8-bit mode.
 *          Can only switch the config if the channel is off.
 *          SetValue uses: Dac(output) = Vref * (value / (Dac(precision) + 1) ) - for 12-bit: Dac(output) = 3.3V * (value / (0xFFF + 1)) --> var = (value * (0xFFF + 1)) / 3.3V
 *          DMA is fixed: DMA1 Channel 7, Stream 5 --> PA4 (Dac Channel 1)
 *                        DMA1 Channel 7, Stream 6 --> PA5 (Dac Channel 2)
 *
 * \author  T. Louwers <terry.louwers@fourtress.nl>
 * \version 1.1
 * \date    05-2021
 */

/************************************************************************/
/* Includes                                                             */
/************************************************************************/
#include "drivers/Dac/Dac.hpp"
#include "utility/Assert/Assert.h"
#include "stm32f4xx_hal_dac.h"


/************************************************************************/
/* Public Methods                                                       */
/************************************************************************/
/**
 * \brief   Constructor, prepares the internal Dac administration.
 */
Dac::Dac() :
    mInitialized(false)
{ ; }

/**
 * \brief   Destructor, stops Dac channels.
 */
Dac::~Dac()
{
    Sleep();
}

/**
 * \brief   Initializes the Dac.
 * \returns True if the Dac could be initialized, else false.
 */
bool Dac::Init()
{
    CheckAndEnablePeripheralClock();

    mHandle.Instance = DAC;

    if (HAL_DAC_Init(&mHandle) == HAL_OK)
    {
        mInitialized = true;
        return true;
    }
    return false;
}

/**
 * \brief   Indicate if Dac is initialized.
 * \returns True if Dac is initialized, else false.
 */
bool Dac::IsInit() const
{
    return mInitialized;
}

/**
 * \brief   Puts the Dac module in sleep mode.
 * \details Stops output on channel(s).
 * \returns True if Dac module could be put in sleep mode, else false.
 */
bool Dac::Sleep()
{
    StopChannel(Channel::CHANNEL_1);
    StopChannel(Channel::CHANNEL_2);

    SetWaveform(Channel::CHANNEL_1, nullptr, 0);
    SetWaveform(Channel::CHANNEL_2, nullptr, 0);

    if (HAL_DAC_DeInit(&mHandle) != HAL_OK) { return false; }

    mInitialized = false;

    CheckAndDisablePeripheralClock();
    return true;
}

/**
 * \brief   Link a configured DMA stream into the Dac's channel-1 or channel-2 slot.
 * \param   channel The Dac channel whose DMA slot to wire (CHANNEL_1 → DMA_Handle1,
 *                  CHANNEL_2 → DMA_Handle2).
 * \param   dma     A DMA object that has been Configure()'d with Direction
 *                  MemoryToPeripheral (both Dac channels are outputs).
 * \returns True if the DMA was linked, false if dma was not configured or
 *          its Direction is not MemoryToPeripheral.
 */
bool Dac::LinkDma(const Channel& channel, DMA& dma)
{
    if (!dma.IsConfigured())                                            { return false; }
    if (dma.GetDirection() != DMA::Direction::MemoryToPeripheral)       { return false; }

    switch (channel)
    {
        case Channel::CHANNEL_1:
            __HAL_LINKDMA(&mHandle, DMA_Handle1, *dma.Handle());
            mDmaCh1 = &dma;
            return true;
        case Channel::CHANNEL_2:
            __HAL_LINKDMA(&mHandle, DMA_Handle2, *dma.Handle());
            mDmaCh2 = &dma;
            return true;
        default:
            ASSERT(false);
            return false;
    }
}

/**
 * \brief   Configure a channel with a given configuration.
 * \param   channel         The channel to configure.
 * \param   channelConfig   The configuration for the given channel.
 * \returns True if the channel could be configured, else false. Stops the
 *          channel before configuring it.
 */
bool Dac::ConfigureChannel(const Channel& channel, const ChannelConfig& channelConfig)
{
    if (mInitialized)
    {
        DAC_ChannelConfTypeDef chanConf = {};

        chanConf.DAC_OutputBuffer = GetOutputBuffer(channelConfig.mOutputBuffer);
        chanConf.DAC_Trigger      = GetTrigger(channelConfig.mTrigger);

        switch (channel)
        {
            case Channel::CHANNEL_1:
                StopChannel(Channel::CHANNEL_1);
                if (HAL_DAC_ConfigChannel(&mHandle, &chanConf, DAC_CHANNEL_1) == HAL_OK)
                {
                    mChannel1.mPrecision    = channelConfig.mPrecision;
                    mChannel1.mTrigger      = channelConfig.mTrigger;
                    mChannel1.mOutputBuffer = channelConfig.mOutputBuffer;
                    return true;
                }
                break;
            case Channel::CHANNEL_2:
                StopChannel(Channel::CHANNEL_2);
                if (HAL_DAC_ConfigChannel(&mHandle, &chanConf, DAC_CHANNEL_2) == HAL_OK)
                {
                    mChannel2.mPrecision    = channelConfig.mPrecision;
                    mChannel2.mTrigger      = channelConfig.mTrigger;
                    mChannel2.mOutputBuffer = channelConfig.mOutputBuffer;
                    return true;
                }
                break;
            default: ASSERT(false); while(1) { __NOP(); } break;    // Impossible selection
        }
    }
    return false;
}

/**
 * \brief   Configures the waveform for use with the Dac.
 * \param   channel The channel to configure the waveform for.
 * \param   values  Pointer to the buffer containing the waveform values.
 * \param   length  Length of the buffer.
 * \returns True if the waveform could be configured, else false.
 */
bool Dac::ConfigureWaveform(const Channel& channel, const uint16_t* values, uint16_t length)
{
    EXPECT(values);
    EXPECT(length > 0);

    if (nullptr == values) { return false; }
    if (0 == length)       { return false; }
    if (!mInitialized)     { return false; }

    SetWaveform(channel, values, length);
    return true;
}

/**
 * \brief   Output a value with the Dac.
 * \param   channel     The channel on which to output a value.
 * \param   value       The value to output. This is in Dac counts.
 * \returns True if the value could be output, else false. Starts the channel
 *          if needed.
 * \note    The valid range of \p value depends on the configured Precision
 *          (0x000-0x0FF for _8_BIT_R, 0x000-0xFFF for the 12-bit modes). The
 *          HAL masks the value to the register width, so an out-of-range value
 *          is silently truncated rather than rejected.
 */
bool Dac::SetValue(const Channel& channel, uint16_t value)
{
    if (!mInitialized) { return false; }

    switch (channel)
    {
        case Channel::CHANNEL_1:
            if (StartChannel(Channel::CHANNEL_1))
            {
                if (HAL_DAC_SetValue(&mHandle, DAC_CHANNEL_1, GetAlignment(mChannel1.mPrecision), value) == HAL_OK)
                {
                    return true;
                }
            }
            break;
        case Channel::CHANNEL_2:
            if (StartChannel(Channel::CHANNEL_2))
            {
                if (HAL_DAC_SetValue(&mHandle, DAC_CHANNEL_2, GetAlignment(mChannel2.mPrecision), value) == HAL_OK)
                {
                    return true;
                }
            }
            break;
        default: ASSERT(false); while(1) { __NOP(); } break;    // Impossible selection
    }
    return false;
}

/**
 * \brief   Start the configured waveform on the Dac for the given channel.
 * \param   channel     Channel to output the configured waveform on.
 * \note    HAL_DAC_Start_DMA() types pData as uint32_t*, but the buffer is
 *          never dereferenced as uint32_t: the DMA memory data width set
 *          from the channel Precision/alignment governs the access. The
 *          uint16_t* buffer is round-tripped through void* to express the
 *          intentional reinterpretation (and to keep -Wcast-align honest).
 * \note    ES0182 §2.6.2: in DMA mode the DAC DMAUDR underrun flag may fail to
 *          set if an internal trigger coincides with a DMA acknowledge. There is
 *          no silicon workaround; callers must not rely on DMAUDR alone to detect
 *          underrun.
 * \returns True if the waveform could be started on the given channel, else false.
 */
bool Dac::StartWaveform(const Channel& channel)
{
    if (!mInitialized) { return false; }

    switch (channel)
    {
        case Channel::CHANNEL_1:
            if ((nullptr == mHandle.DMA_Handle1) || (0 == mWaveformChannel1.mLength)) { return false; }

            // Invariant: DMA_Handle1 set <-> mDmaCh1 set (LinkDma assigns both together).
            ASSERT(mDmaCh1);

            if (! mChannel1.mStarted)
            {
                if (HAL_DAC_Start_DMA(&mHandle, DAC_CHANNEL_1,
                        static_cast<uint32_t*>(static_cast<void*>(mWaveformChannel1.mValues)), mWaveformChannel1.mLength,
                        GetAlignment(mChannel1.mPrecision)) == HAL_OK)
                {
                    // HAL_DAC_Start_DMA re-enables DMA_IT_HT regardless of the
                    // user's HalfBufferInterrupt selection; reassert it.
                    mDmaCh1->EnforceHalfBufferInterruptSetting();
                    mChannel1.mStarted = true;
                    return true;
                }
            }
            break;
        case Channel::CHANNEL_2:
            if ((nullptr == mHandle.DMA_Handle2) || (0 == mWaveformChannel2.mLength)) { return false; }

            // Invariant: DMA_Handle2 set <-> mDmaCh2 set (LinkDma assigns both together).
            ASSERT(mDmaCh2);

            if (! mChannel2.mStarted)
            {
                if (HAL_DAC_Start_DMA(&mHandle, DAC_CHANNEL_2,
                        static_cast<uint32_t*>(static_cast<void*>(mWaveformChannel2.mValues)), mWaveformChannel2.mLength,
                        GetAlignment(mChannel2.mPrecision)) == HAL_OK)
                {
                    mDmaCh2->EnforceHalfBufferInterruptSetting();
                    mChannel2.mStarted = true;
                    return true;
                }
            }
            break;
        default: ASSERT(false); while(1) { __NOP(); } break;    // Impossible selection
    };
    return false;
}

/**
 * \brief   Stop the configured waveform on the Dac for the given channel.
 * \param   channel     Channel to stop the configured waveform on.
 * \returns True if the waveform could be stopped for the given channel, else false.
 */
bool Dac::StopWaveform(const Channel& channel)
{
    if (!mInitialized) { return false; }

    switch (channel)
    {
        case Channel::CHANNEL_1:
            if (mChannel1.mStarted)
            {
                const bool stopped = (HAL_OK == HAL_DAC_Stop_DMA(&mHandle, DAC_CHANNEL_1));
                mChannel1.mStarted = false;
                return stopped;
            }
            break;
        case Channel::CHANNEL_2:
            if (mChannel2.mStarted)
            {
                const bool stopped = (HAL_OK == HAL_DAC_Stop_DMA(&mHandle, DAC_CHANNEL_2));
                mChannel2.mStarted = false;
                return stopped;
            }
            break;
        default: ASSERT(false); while(1) { __NOP(); } break;    // Impossible selection
    };
    return false;
}

/**
 * \brief   Advance a software-triggered waveform by one sample.
 * \details Writes the current waveform sample on the given channel and
 *          advances the buffer index (wrapping at the configured length).
 *          This is the CPU-driven counterpart to the DMA StartWaveform()
 *          path: configure the channel with Trigger::SOFTWARE, call
 *          ConfigureWaveform(), then call Tick() periodically (e.g. from
 *          a timer callback) to step the output. Each Tick() is a single
 *          HAL_DAC_SetValue() write, so it is safe from an ISR once the
 *          channel is started.
 * \param   channel     The channel whose waveform to advance.
 * \returns True if the next sample was output, else false (channel has no
 *          waveform configured, not initialised, or the write failed).
 */
bool Dac::Tick(const Channel& channel)
{
    if (!mInitialized) { return false; }

    switch (channel)
    {
        case Channel::CHANNEL_1:
        {
            if ((nullptr == mWaveformChannel1.mValues) || (0 == mWaveformChannel1.mLength)) { return false; }

            const uint16_t value = mWaveformChannel1.mValues[mWaveformChannel1.mIndex];
            mWaveformChannel1.mIndex = static_cast<uint16_t>((mWaveformChannel1.mIndex + 1) % mWaveformChannel1.mLength);
            return SetValue(Channel::CHANNEL_1, value);
        }
        case Channel::CHANNEL_2:
        {
            if ((nullptr == mWaveformChannel2.mValues) || (0 == mWaveformChannel2.mLength)) { return false; }

            const uint16_t value = mWaveformChannel2.mValues[mWaveformChannel2.mIndex];
            mWaveformChannel2.mIndex = static_cast<uint16_t>((mWaveformChannel2.mIndex + 1) % mWaveformChannel2.mLength);
            return SetValue(Channel::CHANNEL_2, value);
        }
        default: ASSERT(false); while(1) { __NOP(); } break;    // Impossible selection
    };
    return false;
}


/************************************************************************/
/* Private Methods                                                      */
/************************************************************************/
/**
 * \brief   Enable the peripheral clock for the Dac.
 */
void Dac::CheckAndEnablePeripheralClock()
{
    __HAL_RCC_DAC_CLK_ENABLE();
}

/**
 * \brief   Disable the peripheral clock for the Dac.
 */
void Dac::CheckAndDisablePeripheralClock()
{
    __HAL_RCC_DAC_CLK_DISABLE();
}

/**
 * \brief   Get the translated channel trigger value.
 * \param   trigger     The desired trigger value.
 * \returns Translated channel trigger value.
 */
uint32_t Dac::GetTrigger(const Trigger& trigger)
{
    uint32_t trigger_value = 0;

    switch (trigger)
    {
        case Trigger::NONE:       { trigger_value = DAC_TRIGGER_NONE;     } break;
        case Trigger::TIMER_2:    { trigger_value = DAC_TRIGGER_T2_TRGO;  } break;
        case Trigger::TIMER_4:    { trigger_value = DAC_TRIGGER_T4_TRGO;  } break;
        case Trigger::TIMER_5:    { trigger_value = DAC_TRIGGER_T5_TRGO;  } break;
        case Trigger::TIMER_6:    { trigger_value = DAC_TRIGGER_T6_TRGO;  } break;
        case Trigger::TIMER_7:    { trigger_value = DAC_TRIGGER_T7_TRGO;  } break;
        case Trigger::TIMER_8:    { trigger_value = DAC_TRIGGER_T8_TRGO;  } break;
        case Trigger::EXT_LINE_9: { trigger_value = DAC_TRIGGER_EXT_IT9;  } break;
        // SOFTWARE drives the output via Tick()->HAL_DAC_SetValue (direct DHR
        // write); DAC_TRIGGER_NONE auto-transfers DHR->DOR, which is exactly the
        // per-sample CPU-driven behaviour wanted, so it maps to NONE (not the
        // hardware SWTRIG path). See RM0090 §14.3.2.
        case Trigger::SOFTWARE:   { trigger_value = DAC_TRIGGER_NONE;     } break;
        default: ASSERT(false); while(1) { __NOP(); } break;    // Impossible selection
    }

    return trigger_value;
}

/**
 * \brief   Get the value alignment based upon the selected presicion.
 * \param   precision   The desired precision.
 * \returns The matching value alignment.
 */
uint32_t Dac::GetAlignment(const Precision& precision)
{
    uint32_t alignment = 0;

    switch (precision)
    {
        case Precision::_8_BIT_R:  { alignment = DAC_ALIGN_8B_R;  } break;
        case Precision::_12_BIT_L: { alignment = DAC_ALIGN_12B_L; } break;
        case Precision::_12_BIT_R: { alignment = DAC_ALIGN_12B_R; } break;
        default: ASSERT(false); while(1) { __NOP(); } break;    // Impossible selection
    }

    return alignment;
}

/**
 * \brief   Get the translated channel output buffer value.
 * \param   outputBuffer    The desired output buffer state.
 * \returns Translated output buffer value.
 */
uint32_t Dac::GetOutputBuffer(const OutputBuffer& outputBuffer)
{
    uint32_t outputBuffer_value = 0;

    switch (outputBuffer)
    {
        case OutputBuffer::ENABLE:  { outputBuffer_value = DAC_OUTPUTBUFFER_ENABLE;  } break;
        case OutputBuffer::DISABLE: { outputBuffer_value = DAC_OUTPUTBUFFER_DISABLE; } break;
        default: ASSERT(false); while(1) { __NOP(); } break;    // Impossible selection
    }

    return outputBuffer_value;
}

/**
 * \brief   Start the Dac channel (if not started before).
 * \param   channel     The channel to start.
 * \returns True if the channel is started, else false.
 */
bool Dac::StartChannel(const Channel& channel)
{
    switch (channel)
    {
        case Channel::CHANNEL_1:
            if (mChannel1.mStarted) { return true; }    // Already started

            if (HAL_DAC_Start(&mHandle, DAC_CHANNEL_1) == HAL_OK)
            {
                mChannel1.mStarted = true;
                return true;
            }
            break;
        case Channel::CHANNEL_2:
            if (mChannel2.mStarted) { return true; }    // Already started

            if (HAL_DAC_Start(&mHandle, DAC_CHANNEL_2) == HAL_OK)
            {
                mChannel2.mStarted = true;
                return true;
            }
            break;
        default: ASSERT(false); while(1) { __NOP(); } break;    // Impossible selection
    };
    return false;
}

/**
 * \brief   Stop the Dac channel (if started before).
 * \param   channel     The channel to stop.
 * \returns True if the channel is stopped, else false.
 */
bool Dac::StopChannel(const Channel& channel)
{
    switch (channel)
    {
        case Channel::CHANNEL_1:
            if (mChannel1.mStarted)
            {
                const HAL_StatusTypeDef result = (0 == mWaveformChannel1.mLength)
                    ? HAL_DAC_Stop(&mHandle, DAC_CHANNEL_1)
                    : HAL_DAC_Stop_DMA(&mHandle, DAC_CHANNEL_1);
                mChannel1.mStarted = false;
                return (HAL_OK == result);
            }
            break;
        case Channel::CHANNEL_2:
            if (mChannel2.mStarted)
            {
                const HAL_StatusTypeDef result = (0 == mWaveformChannel2.mLength)
                    ? HAL_DAC_Stop(&mHandle, DAC_CHANNEL_2)
                    : HAL_DAC_Stop_DMA(&mHandle, DAC_CHANNEL_2);
                mChannel2.mStarted = false;
                return (HAL_OK == result);
            }
            break;
        default: ASSERT(false); while(1) { __NOP(); } break;    // Impossible selection
    };
    return false;
}

/**
 * \brief   For the given channel, set the waveform administration.
 * \param   channel     The channel for which to set the waveform.
 * \param   values      Pointer to the buffer containing the waveform values.
 * \param   length      Length of the buffer.
 */
void Dac::SetWaveform(const Channel& channel, const uint16_t* values, uint16_t length)
{
    switch (channel)
    {
        case Channel::CHANNEL_1:
            mWaveformChannel1.mValues = const_cast<uint16_t*>(values);
            mWaveformChannel1.mLength = length;
            mWaveformChannel1.mIndex  = 0;
            break;
        case Channel::CHANNEL_2:
            mWaveformChannel2.mValues = const_cast<uint16_t*>(values);
            mWaveformChannel2.mLength = length;
            mWaveformChannel2.mIndex  = 0;
            break;
        default: ASSERT(false); while(1) { __NOP(); } break;    // Impossible selection
    };
}
